Vagrant/tenda/app/Http/Controllers/ShopController.php

    public function getSubcategories(Request $request)
    {
        $categories = $request->get('categories');
---
select * from `categories`

    public function show(string $shopName)
    {
        Log::debug("Intentando acceder a la tienda: " . $shopName);

        try {

            $shop = Shop::where('name', '=', $shopName)->firstOrFail();
---
select * from `shops` where `name` = 'Test Tienda' limit 1